#+title: Gerbil.js? Gambit has JS so use it
#+date: <2023-01-09 14:51>
#+description: Gerbil uses Gambit, Gambit can use JS. We just need to connect them.
#+filetags: gerbil gambit scheme javascript

*** A lot more vectors

#+begin_src sh :results verbatim :wrap example
  MuKn_SRC=$HOME/me/MuKn/src
  export GERBIL_HOME=$MuKn_SRC/gerbil/bootstrap
  export GERBIL_GSI=$MuKn_SRC/gambit/gsi-js

  PATH=$MuKn_SRC/gambit/gsc:$PATH/src
  cd $MuKn_SRC/gerbil/src && ./build.sh stage0

  MuKn_gxi=$MuKn_SRC/gerbil/bootstrap/bin/gxi

  $MuKn_gxi -e '(display 42)' # 2>&1 | cat

#+end_src

#+RESULTS:
#+begin_example
#+end_example

*=>*
#+begin_example
,*** ERROR IN gx#root-context:::init!__% -- struct-instance-init!: too many arguments for struct #<root-context #2>
>
,*** EOF again to exit
#+end_example

It turns out there are a lot more uses of vector functions for things that are not vectors in the JavaScript Gambit backend but are in the C backend. Sigh.





